In [3]:
import numpy as np
import pandas as pd
import re

In [4]:
#Importamos csv
df=pd.read_csv('HR RAW DATA.csv')
df.head()

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [5]:
#Creamos nueva variable para guardar la selección del rango de columnas que queremos.
#Este será nuestro csv
df_data=df.iloc[:, 1:]
df_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [6]:
#Visualizamos la información básica del DataFram
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 517.1+ KB

In [7]:
#Exportamos el csv
df_data.to_csv('hr_data.csv', index=False)

In [8]:
#celda marga

In [9]:
#celda sharon

In [10]:
#celda isa

In [11]:
#celda silvia

In [32]:
#celda lidia


#Seleccionamos los 10 primeros
df_col_1=df.iloc[:, 0:11]

In [33]:
df_col_1

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0"
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0"
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0"
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1609,1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0"
1610,1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0"
1611,1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN
1612,1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0"
1613,1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN

In [34]:
df_col_1["employeenumber"].unique()

array(['162,0', '259,0', '319,0', ..., '2012,0', '2023,0', '2040,0'],
      dtype=object)

In [14]:
# otra manera de cambiar los nombres de las columnas.  porque no se guardan todos los cambios?? -- tiene que ir todo en la misma linea!!
#df_col_1 = df.rename(columns={'DailyRate': 'daily_rate'})
#df_col_1= df.rename(columns={"Age":"age"})
#df_col_1

In [15]:
df_col_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1614 non-null   int64
 1   Age               1614 non-null   object
 2   Attrition         1614 non-null   object
 3   BusinessTravel    842 non-null    object
 4   DailyRate         1614 non-null   object
 5   Department        302 non-null    object
 6   DistanceFromHome  1614 non-null   int64
 7   Education         1614 non-null   int64
 8   EducationField    869 non-null    object
 9   employeecount     1614 non-null   int64
dtypes: int64(4), object(6)
memory usage: 126.2+ KB

In [16]:
#codigo de MArga para limpiar los nombres de la columnaas
colum_limpias=[]
for columna in df_col_1:
    patron='[A-Z][^A-Z]*'
    columna_limpia=re.findall(patron,columna)
    columna_limpia1='_'.join(columna_limpia)
    columna_min=columna_limpia1.lower()
    colum_limpias.append(columna_min)
df_col_1= colum_limpias
df_col_1

['unnamed: 0',
 'age',
 'attrition',
 'business_travel',
 'daily_rate',
 'department',
 'distance_from_home',
 'education',
 'education_field',
 '']

In [17]:
print(df["Age"].unique())

['51' '52' '42' '47' '46' '48' '59' '41' '56' '38' '55' '40' '58' '35'
 '45' '33' '36' '34' 'forty-seven' '53' '43' '60' '32' '37' '49' '39' '50'
 '44' '30' 'fifty-eight' '29' '31' '54' '57' '27' 'thirty-six' '28' '26'
 'fifty-five' '25' 'fifty-two' 'thirty-one' '24' 'thirty' '23' '22' '21'
 '20' 'twenty-six' '19' 'thirty-seven' '18' 'thirty-two' 'twenty-four']

In [18]:
#pasamos la primera columna que es un objeto a numero entero
#df_col_1
#df_col_1['age'] = pd.to_numeric(df_col_1['age'])
# no se puede pasar porque no todos los valores son numeros.
# convertir los valores que no son nmumeros a Nan
# Usar pd.to_numeric con errors='coerce' para convertir valores no numéricos a NaN
df_col_1['age'] = pd.to_numeric(df_col_1['age'], errors='coerce').astype('Int64')

# Ahora los valores no numéricos son NaN. Si se desea, estos NaN se pueden rellenar o eliminar
# Rellenar NaN con un valor específico, por ejemplo, la media
df_col_1['age'].fillna(df_col_1['age'].mean(), inplace=True)

TypeError: list indices must be integers or slices, not str